

# print("     zxcvasdf     ") # 그대로 출력하는 법
'''
print('     zxcvasdf     ') # "여기다 " '여기다 '

print('     zxcvasdf     ') 
'''

'''
ㅇㅇㅇㅇㅇㅇㅇ
'''

""

x=2
y=1

'''
A = ' 가렌 - 정의의 전장으로! ' 

print('가렌 - 정의의 전장으로!
                    ')
print('갈리오 - 수호자는 언제나 준비되있지')
print('갱플랭크 - 승선을 준비하라!')
print('그라가스 - 니가 사는거라면 나도 끼지')
print('그레이브즈 - 내가 돌아왔다')

'''
'''
print("이 대사를 말하는 챔피언을 쓰세요")
a = input('정의의 전장으로!:')
b = input('수호자는 언제나 준비되있지:')
c = input('승선을 준비하라!')
d = input('니가 사는거라면 나도 끼지')
e = input('내가 돌아왔다:')
'''

L=['라이즈', '람머스', '럼블', '레넥톤', '레오나']




a = [i for i in input().split('☆')]


p

print(a)



print(a[3])

'''
if(a>b):
    print("a가 더 크다")
if(a<=b):
    print("a가 더 크지 않다")

'''


'''

if a =='가렌':
    print("가렌이 맞습니다.")
if a !='가렌':
    print("틀렸습니다.답은 가렌입니다.")




if b =='갈리오':
    print("가렌이 맞습니다.")

    '''
'''

'''

'''
가렌 - 정의의 전장으로! / 갈리오 - 수호자는 언제나 준비되있지 / 갱플랭크 - 승선을 준비하라! / 그라가스 - 니가 사는거라면 나도 끼지 / 그레이브즈 - 내가 돌아왔다

'''
'''
나서스 - 삶과 죽음의 순환은 계속된다. 우리는 살것
이고 저들은 죽을것이다.
노틸러스 - 물이 깊으니 조심해
녹턴 - 어둠을 맞이하라
누누 - 간다!
니달리 - 야생을 두려워 하게 만들어주지
다리우스 - 오직 나만이 승리로 이끌수 있다.
다이애나 - 새로운 달이 떠오르고 있다.
드레이븐 - 드레이븐의 리그에 오신걸 환영한다.
라이즈 - 가자고, 어서!
람머스 - 그래
럭스 - 전략적인 선택이군요, 소환사님
럼블 - 자 한번 붙어보자고
레넥톤- 내가 살아있는 한, 모두 죽는다
레오나 - 새벽이 밝았습니다.
렝가 - 오늘밤 사냥을 나선다
룰루 - 만나서 반갑습니다.
르블랑 - 검은장미단은 다시 피어날겁니다.
리신 - 당신의 뜻대로 싸우겟소
리븐 - 부러진 건 다시 붙이면 되
마스터 이 - 나의 검은 당신의 것이오
마오카이 - 시키는대로 하겠소, 지금은 말이지
말자하 - 종말이 기다린다.
'''
