N, K = [int(i) for i in input().split()]
'''
20 2
0 20, 1 19 , ... , 19 1, 20 0   21개

20 3
0 0 20, 0 1 19, ...,            21개 
1 0 19, 1 1 18, ..., 1 19 0     20개
2 시작 19개
3 시작 18개
.
.
.
19 0 1, 19 1 0                  2개
20 00                           1개

20 4
0 0 0 20, 0 0 1 19              21개
'''

dp=[]

for _ in range(K+1):
    dp.append([0]*(N+1))

# 3 4 에 필요한 정수 4개를 더해서 합이 3되는

# 3 0
# 3 1
# 3 2
# 3 3
# 3 4



# 4
# 0 0 0 3

# dp[i][j]: 숫자 j를 정수 i개로 나타내는 가짓수
# dp[K][N]: dp[K-1][N]+ ~ +dp[K-1][0]

for j in range(N+1): # 숫자 j를 정수 1개로 나타내는 가짓수는 j+1
    dp[1][j] = 1


''' 쓸 필요없음
for j in range(N+1): # 숫자 j를 정수 2개로 나타내는 가짓수는 j+1
    dp[2][j] = j+1

'''

for i in range(1, K+1): # 숫자 0를 정수 i개로 나타내는 가짓수는 1
    dp[i][0] = 1

for i in range(2,K+1):
    for j in range(1, N+1): # 0 0 2, 0 1 1, 0 2 0, 1 0 1, 1 1 0, 2 0 0 
        # j = N
        # j+1 N+1

        dp[i][j] = sum(dp[i-1][:j+1])
        '''
        dp[2][j] = dp[1][j]+ ~ dp[1][0]
        dp[3][1] = dp[2][1]+ dp[2][0] = dp[2][:2]
        dp[3][2] = dp[2][2]+ dp[2][1]+ dp[2][0] = dp[2][:3]
        dp[3][3] = dp[2][3]+ dp[2][2]+ dp[2][1]+dp[2][0]
        '''
print(dp[K][N]%int(1e9))

# 200*3 = 800만 런타임에러?